In [48]:
import mysql.connector

In [50]:
myconn = mysql.connector.connect(
    host="localhost",
    user="root",
    passwd="Snehal@12345",
    auth_plugin="mysql_native_password"
)

In [52]:
cur = myconn.cursor()

In [56]:
cur.execute("create database prac")

In [58]:
myconn = mysql.connector.connect(
    host="localhost",
    user="root",
    passwd="Snehal@12345",
    database="prac")

In [60]:
cur.execute("use prac")

#1. Create a Python program to accept product details from user and insert into Producttable of MySQL. Assume suitable table structure.

In [62]:
dbs = cur.execute('''
        CREATE TABLE  Product (
            Product_ID INT PRIMARY KEY,
            Product_Name VARCHAR(100) NOT NULL,
            Price FLOAT NOT NULL,
            Quantity INT NOT NULL
        )
    ''')

In [64]:
for i in range(2):
    product_id = int(input("Enter Product ID: "))
    product_name = input("Enter Product Name: ")
    price = float(input("Enter Product Price: "))
    quantity = int(input("Enter Product Quantity: "))
    record = (product_id, product_name, price, quantity)
    cur.execute("INSERT INTO Product (Product_ID, Product_Name, Price, Quantity) VALUES (%s, %s, %s, %s)", record)
    myconn.commit()

Enter Product ID:  1
Enter Product Name:  Book
Enter Product Price:  70
Enter Product Quantity:  3
Enter Product ID:  2
Enter Product Name:  Pen
Enter Product Price:  50
Enter Product Quantity:  100

In [66]:
cur.execute("SELECT * FROM Product")
result = cur.fetchall()
print("\nProduct Details:")
for row in result:
    print(row)

Product Details:
(1, 'Book', 70.0, 3)
(2, 'Pen', 50.0, 100)

In [ ]:
#2. Create a Python program to retrieve student details from Student table those are placed in TCS Company. Assume suitable table structure.

In [ ]:
dbs = cur.execute('''
    CREATE TABLE IF NOT EXISTS Student (
        Student_ID INT PRIMARY KEY,
        Name VARCHAR(100) NOT NULL,
        Age INT NOT NULL,
        Branch VARCHAR(50),
        Placement_Company VARCHAR(100)
    )
''')

In [77]:
for i in range(2):  # Adjust the range for the number of records you want to insert
    student_id = int(input("Enter Student ID: "))
    name = input("Enter Student Name: ")
    age = int(input("Enter Age: "))
    branch = input("Enter Branch: ")
    placement_company = input("Enter Placement Company: ")

    # Tuple to hold the record
    record = (student_id, name, age, branch, placement_company)

    # Insert the record into Student table
    cur.execute("INSERT INTO Student (Student_ID, Name, Age, Branch, Placement_Company) VALUES (%s, %s, %s, %s, %s)", record)
    myconn.commit()

print("Data inserted successfully!")

Enter Student ID:  1
Enter Student Name:  Snehal
Enter Age:  21
Enter Branch:  DS
Enter Placement Company:  TCS
Enter Student ID:  2
Enter Student Name:  Siya
Enter Age:  23
Enter Branch:  DA
Enter Placement Company:  Pattern

Data inserted successfully!

In [79]:
cur.execute("SELECT * FROM Student")
result = cur.fetchall()

print("\nStudent Table Data:")
for row in result:
    print(row)

Student Table Data:
(1, 'Snehal', 21, 'DS', 'TCS')
(2, 'Siya', 23, 'DA', 'Pattern')

In [83]:
cur.execute("SELECT * FROM Student WHERE Placement_Company = 'TCS'")
result = cur.fetchall()
print("\nStudent Table Data:")
for row in result:
    print(row)

Student Table Data:
(1, 'Snehal', 21, 'DS', 'TCS')

In [86]:
#3. Create a Python program to display area wise product sales details for electronic products in a year. Assume suitable table structure.

In [88]:
dbs = cur.execute('''
        CREATE TABLE ProductSales (
            Sale_ID INT PRIMARY KEY,
            Product_Name VARCHAR(100) NOT NULL,
            Category VARCHAR(50) NOT NULL,
            Area VARCHAR(100) NOT NULL,
            Sales_Amount FLOAT NOT NULL,
            Sale_Date DATE NOT NULL
        )
    ''')

In [92]:
for i in range(2):  # Adjust the range for the number of records you want to insert
    sale_id = int(input("Enter Sale ID: "))
    product_name = input("Enter Product Name: ")
    category = input("Enter Product Category: ")
    area = input("Enter Area: ")
    sales_amount = float(input("Enter Sales Amount: "))
    sale_date = input("Enter Sale Date (YYYY-MM-DD): ")
    
    # Tuple to hold the record
    record = (sale_id, product_name, category, area, sales_amount, sale_date)

    # Insert the record into ProductSales table
    cur.execute("INSERT INTO ProductSales (Sale_ID, Product_Name, Category, Area, Sales_Amount, Sale_Date) VALUES (%s, %s, %s, %s, %s, %s)", record)
    myconn.commit()

print("Data inserted successfully!")

Enter Sale ID:  3
Enter Product Name:  Mobile
Enter Product Category:  Electronic
Enter Area:  Pune
Enter Sales Amount:  50000
Enter Sale Date (YYYY-MM-DD):  2024-07-21
Enter Sale ID:  4
Enter Product Name:  Laptop
Enter Product Category:  Electronic
Enter Area:  Nagar
Enter Sales Amount:  100000
Enter Sale Date (YYYY-MM-DD):  2024-12-5

Data inserted successfully!

In [94]:
cur.execute("select * from ProductSales")
result= cur.fetchall()
for r in result:
    print(r)

(1, 'Book', 'Stationary', 'Pune', 70.0, datetime.date(2024, 8, 28))
(2, 'Pen', ' Stationary', 'Nagar', 1000.0, datetime.date(2024, 9, 23))
(3, 'Mobile', 'Electronic', 'Pune', 50000.0, datetime.date(2024, 7, 21))
(4, 'Laptop', 'Electronic', 'Nagar', 100000.0, datetime.date(2024, 12, 5))

In [104]:
# Query to retrieve and display area-wise product sales details for electronic products in 2024
cur.execute('''
    SELECT Area, Product_Name, SUM(Sales_Amount) AS Total_Sales
    FROM ProductSales
    WHERE Category = 'Electronic' AND YEAR(Sale_Date) = 2024
    GROUP BY Area, Product_Name
    ORDER BY Area, Product_Name
''')

# Fetch all the results
result = cur.fetchall()

# Display the results in a formatted manner
print("\nArea Wise Product Sales for Electronic Products in 2024")
print("{:<20} {:<30} {:<15}".format("Area", "Product Name", "Total Sales"))
print("-" * 65)

for row in result:
    area, product_name, total_sales = row
    print("{:<20} {:<30} {:<15}".format(area, product_name, total_sales))

Area Wise Product Sales for Electronic Products in 2024
Area                 Product Name                   Total Sales
-----------------------------------------------------------------
Nagar                Laptop                         100000.0
Pune                 Mobile                         50000.0

In [116]:
#4. Create a Python program to increase the salary of employee by 10% those who have working experience more than 20 years. Assume suitable table structure.

In [118]:
dbs= cur.execute('''
    CREATE TABLE IF NOT EXISTS Employee (
        Employee_ID INT PRIMARY KEY,
        Name VARCHAR(100),
        Age INT,
        Salary FLOAT,
        Experience INT
    )
''')

In [112]:
for i in range(2):  # Adjust the range for the number of records you want to insert
    employee_id = int(input("Enter Employee ID: "))
    name = input("Enter Employee Name: ")
    age = int(input("Enter Employee Age: "))
    salary = float(input("Enter Employee Salary: "))
    experience = int(input("Enter Employee Experience (in years): "))
    
    # Tuple to hold the record
    record = (employee_id, name, age, salary, experience)

    # Insert the record into Employee table
    cur.execute("INSERT INTO Employee (Employee_ID, Name, Age, Salary, Experience) VALUES (%s, %s, %s, %s, %s)", record)
    myconn.commit()

print("Data inserted successfully!")

Enter Employee ID:  3
Enter Employee Name:  Snehal
Enter Employee Age:  25
Enter Employee Salary:  50000
Enter Employee Experience (in years):  22
Enter Employee ID:  4
Enter Employee Name:  Ravi
Enter Employee Age:  50
Enter Employee Salary:  700000
Enter Employee Experience (in years):  24

Data inserted successfully!

In [114]:
# Increase salary by 10% for employees with more than 20 years of experience
cur.execute('''
    UPDATE Employee
    SET Salary = Salary * 1.10
    WHERE Experience > 20
''')

# Commit the changes to the database
myconn.commit()

# Display the updated details of employees
cur.execute('SELECT * FROM Employee')
result = cur.fetchall()

print("\nUpdated Employee Details:")
print("-" * 60)
print("{:<15} {:<20} {:<5} {:<10} {:<10}".format("Employee ID", "Name", "Age", "Salary", "Experience"))
print("-" * 60)

# Print the employee records
for row in result:
    print("{:<15} {:<20} {:<5} {:<10} {:<10}".format(row[0], row[1], row[2], row[3], row[4]))

print("\nSalary updated successfully!")

Updated Employee Details:
------------------------------------------------------------
Employee ID     Name                 Age   Salary     Experience
------------------------------------------------------------
1               Savi                 24    50000.0    2
2               Sai                  25    25.41      21
3               Snehal               25    55000.0    22
4               Ravi                 50    770000.0   24

Salary updated successfully!